# Программа просит ввести возраст пользователя. Если его возраст младше 18,
# говорит, что ему еще рано работать с этой программой и завершается.
# Если его возраст старше 65, говорит, что он слишком стар для этой программы и завершается.
# Если он старше 18 и младше 65, то выводит сообщение с приветствием и
# что-то еще делает (можете пофантазировать) и тоже завершается.

a = input('Введите свой возраст:')
b = int(a)
if b<18:
    print('Вам рано пользоваться программой')
elif b>65:
    print('Вам поздно пользоваться программой')
else:
    print('Здравствуйте')
    c = input('Введите свое имя')
    print(b, c)


