#Напишите функцию, которая принимает неограниченное количество аргументов
# и возвращает минимальное и максимальное значения.
def my_funct(*args):
    return max(args), min(args)
print(my_funct(1, 2, 4))
