#Напишите программу которая умеет переводить одни величины в другие: градусы цельсия в фаренгейты,
# мили в километры, километры в метры, морские мили в километры, километры в футы.
# Программы при запуске спрашивает у пользователя что ей сделать и потом работает с входными данными.
# Сделайте так, чтобы пользователь мог пользоваться программой столько,
# сколько нужно, пока не решит выйти из программы, выбрав соответствующий пункт.
def grad_to_faring():
    gr_c = int(input('Введите градусы цельсия:'))
    gr_f = gr_c * 1.8 +32
    print('Результат:', gr_f, 'градусов фаренгейта')

def mil_in_km():
    mi = int(input('Введите количество миль:'))
    km = mi * 1,609
    print('Результат:', km, 'километров')

def kmm_in_m():
    kmm = int(input('Введите количество километров:'))
    m = kmm * 1000
    print('Результат:', m, 'метров')

def mor_mil_in_km():
    mor_mil = int(input('Введите количество морских миль:'))
    kmmm = mor_mil * 1.852
    print('Результат:', kmmm, 'километров')

def km_in_fut():
    kil = int(input('Введите количество километров:'))
    fut = kil * 3280.84
    print('Результат:', fut, 'футов')
while True:
    print('Введите число:')
    print('0 - Выход')
    print('1 - перевести градусы цельсия в фарингейты')
    print('2 - перевести мили в километры')
    print('3 - перевести километры в метры')
    print('4 - перевести морские мили в километры')
    print('5 - перевести километры в футы')
    cmd = int(input())
    if cmd == 0:
        print('выход из программы')
        break
    elif cmd == 1:
        grad_to_faring()
    elif cmd == 2:
        mil_in_km()
    elif cmd == 3:
        kmm_in_m()
    elif cmd == 4:
        mor_mil_in_km()
    elif cmd == 5:
        km_in_fut()
