#Посчитайте количество букв и количество слов в отрывке произв/ А.С. Пушкина «У Лукоморья дуб зеленый»
# (отрывок из поэмы «Руслан и Людмила). Сколько раз встречается буква «а» в независимости от регистра?
# При выводе результатов в консоль используйте метод .format() и f-строки.
string = '''У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.'''

start = ord('А') # код первой буквы алфавита
end = ord('я')  # код последней буквы алфавита
char_num = 0
for a in string:
    code = ord(a)
    if start <= code and end >= code:
        char_num += 1
print(f'Количество букв: {char_num}')
words = string.split()
word_num = len(words )
print(f'количество слов: {word_num}')
