# Напишите программу, которая считает сумму от 999 до 10000,
# при этом учитываются только числа кратные 3 (которые делятся на 3 без остачи) и выводит сумму на экран на экран.
sum = 0
for a in range(999, 10000, 3):
    sum += a
print(sum)