# Пользователь вводит два числа. Программа выводит диапазон чисел на экран от первого до последнего (не включая в диапазон последнее),
# но есть условия:
# - первое вводимое число должно быть больше второго, иначе ничего не произойдет;
# - выводятся все числа, за исключением тех, которые кратны 5;
# - если в диапазоне встречаются числа 23 или 32, то вывод идет до этих чисел и прерывается.
# Решите задание с помощью цикла `while ...` и с помощью цикла `for .. in .. `, можете в разных файлах.
a = int(input('Input first number: '))
b = int(input('Input second number: '))
if a<b:
    c = range(a, b)
    for d in c:
        if d%5 != 0:
            print(d)

        if d == 23 or d == 32:
            break




